"""OSIS 命令流 PROPERTY 模块 — 几何属性(坐标系、收缩徐变特性、钢束线型等)"""

from __future__ import annotations

from pyosis import batch

from pyosis.core.engine import OSISEngine

def build_property(engine: OSISEngine) -> None:
    # 创建样条曲线（便捷入口，内部转发到对应 create_* 方法）
    engine.geometry.create_arc3d("钢束-1-N1-1", "TENDON", [0.18, 0.0, -0.4, 0.0, 6.08465, 0.0, -1.125, 20.0, 13.6953, 0.0, -1.125, 20.0, 19.6, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-10-N2-2", "TENDON", [0.02, 0.0, -0.65, 0.0, 4.90661, 0.0, -1.25, 20.0, 14.5534, 0.0, -1.25, 20.0, 19.44, 0.0, -0.65, 0.0])
    engine.geometry.create_arc3d("钢束-11-N3-2", "TENDON", [0.02, 0.0, -0.9, 0.0, 3.88856, 0.0, -1.375, 20.0, 15.5714, 0.0, -1.375, 20.0, 19.44, 0.0, -0.9, 0.0])
    engine.geometry.create_arc3d("钢束-12-N4-2", "TENDON", [0.02, 0.0, -1.15, 0.0, 1.85248, 0.0, -1.375, 20.0, 17.6075, 0.0, -1.375, 20.0, 19.44, 0.0, -1.15, 0.0])
    engine.geometry.create_arc3d("钢束-13-T1-1", "TENDON", [1.42, 0.0, -0.4, 0.0, 3.40252, 0.0, -0.086, 10.0, 11.4375, 0.0, -0.086, 10.0, 13.42, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-14-T1-2", "TENDON", [1.5, 0.0, -0.4, 0.0, 3.48252, 0.0, -0.086, 10.0, 11.5175, 0.0, -0.086, 10.0, 13.5, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-2-N2-1", "TENDON", [0.18, 0.0, -0.65, 0.0, 5.06661, 0.0, -1.25, 20.0, 14.7134, 0.0, -1.25, 20.0, 19.6, 0.0, -0.65, 0.0])
    engine.geometry.create_arc3d("钢束-3-N3-1", "TENDON", [0.18, 0.0, -0.9, 0.0, 4.04856, 0.0, -1.375, 20.0, 15.7314, 0.0, -1.375, 20.0, 19.6, 0.0, -0.9, 0.0])
    engine.geometry.create_arc3d("钢束-4-N4-1", "TENDON", [0.18, 0.0, -1.15, 0.0, 2.01248, 0.0, -1.375, 20.0, 17.7675, 0.0, -1.375, 20.0, 19.6, 0.0, -1.15, 0.0])
    engine.geometry.create_arc3d("钢束-5-N5-1", "TENDON", [0.02, 0.0, -0.4, 0.0, 5.92465, 0.0, -1.125, 20.0, 13.4753, 0.0, -1.125, 20.0, 19.38, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-6-N6-1", "TENDON", [0.02, 0.0, -0.65, 0.0, 4.90661, 0.0, -1.25, 20.0, 14.4934, 0.0, -1.25, 20.0, 19.38, 0.0, -0.65, 0.0])
    engine.geometry.create_arc3d("钢束-7-N7-1", "TENDON", [0.02, 0.0, -0.9, 0.0, 3.88856, 0.0, -1.375, 20.0, 15.5114, 0.0, -1.375, 20.0, 19.38, 0.0, -0.9, 0.0])
    engine.geometry.create_arc3d("钢束-8-N8-1", "TENDON", [0.02, 0.0, -1.15, 0.0, 1.85248, 0.0, -1.375, 20.0, 17.5475, 0.0, -1.375, 20.0, 19.38, 0.0, -1.15, 0.0])
    engine.geometry.create_arc3d("钢束-9-N1-2", "TENDON", [0.02, 0.0, -0.4, 0.0, 5.92465, 0.0, -1.125, 20.0, 13.5353, 0.0, -1.125, 20.0, 19.44, 0.0, -0.4, 0.0])

if __name__ == "__main__":
    from _0_engine import engine
    with batch():
        build_property(engine)
