"""OSIS 命令流 PROPERTY 模块 — 几何属性(坐标系、收缩徐变特性、钢束线型等)"""

from __future__ import annotations

from pyosis import batch

from pyosis.core.engine import OSISEngine

def build_property(engine: OSISEngine) -> None:
    # 创建样条曲线（便捷入口，内部转发到对应 create_* 方法）
    engine.geometry.create_arc3d("钢束-1-N1-1", "TENDON", [0.2, 0.0, -0.6, 0.0, 8.50723, 0.0, -1.62, 100.0, 20.4283, 0.0, -1.62, 80.0, 29.55, 0.0, -0.5, 0.0])
    engine.geometry.create_arc3d("钢束-10-N2-2", "TENDON", [0.02, 0.0, -0.8, 0.0, 7.75713, 0.0, -1.75, 90.0, 22.4473, 0.0, -1.75, 100.0, 29.37, 0.0, -0.9, 0.0])
    engine.geometry.create_arc3d("钢束-11-N3-2", "TENDON", [0.02, 0.0, -1.1, 0.0, 6.33187, 0.0, -1.875, 90.0, 23.8526, 0.0, -1.875, 80.0, 29.35, 0.0, -1.2, 0.0])
    engine.geometry.create_arc3d("钢束-12-N4-2", "TENDON", [0.02, 0.0, -1.5, 0.0, 2.68826, 0.0, -1.875, 25.0, 26.6817, 0.0, -1.875, 25.0, 29.35, 0.0, -1.5, 0.0])
    engine.geometry.create_arc3d("钢束-13-T1-1", "TENDON", [0.92, 0.0, -0.4, 0.0, 2.90252, 0.0, -0.086, 10.0, 15.9375, 0.0, -0.086, 10.0, 17.92, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-14-T2-1", "TENDON", [0.92, 0.0, -0.4, 0.0, 2.90252, 0.0, -0.086, 10.0, 15.9375, 0.0, -0.086, 10.0, 17.92, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-15-T1-2", "TENDON", [0.91, 0.0, -0.4, 0.0, 2.89252, 0.0, -0.086, 10.0, 15.9275, 0.0, -0.086, 10.0, 17.91, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-16-T2-2", "TENDON", [0.91, 0.0, -0.4, 0.0, 2.89252, 0.0, -0.086, 10.0, 15.9275, 0.0, -0.086, 10.0, 17.91, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-2-N2-1", "TENDON", [0.2, 0.0, -0.9, 0.0, 7.12269, 0.0, -1.75, 100.0, 21.8129, 0.0, -1.75, 90.0, 29.55, 0.0, -0.8, 0.0])
    engine.geometry.create_arc3d("钢束-3-N3-1", "TENDON", [0.22, 0.0, -1.2, 0.0, 5.71743, 0.0, -1.875, 80.0, 23.2381, 0.0, -1.875, 90.0, 29.55, 0.0, -1.1, 0.0])
    engine.geometry.create_arc3d("钢束-4-N4-1", "TENDON", [0.22, 0.0, -1.5, 0.0, 2.88826, 0.0, -1.875, 25.0, 26.8817, 0.0, -1.875, 25.0, 29.55, 0.0, -1.5, 0.0])
    engine.geometry.create_arc3d("钢束-5-N5-1", "TENDON", [0.02, 0.0, -0.5, 0.0, 9.14167, 0.0, -1.62, 80.0, 20.1583, 0.0, -1.62, 80.0, 29.28, 0.0, -0.5, 0.0])
    engine.geometry.create_arc3d("钢束-6-N6-1", "TENDON", [0.02, 0.0, -0.8, 0.0, 7.75713, 0.0, -1.75, 90.0, 21.5429, 0.0, -1.75, 90.0, 29.28, 0.0, -0.8, 0.0])
    engine.geometry.create_arc3d("钢束-7-N7-1", "TENDON", [0.02, 0.0, -1.1, 0.0, 6.33187, 0.0, -1.875, 90.0, 22.9681, 0.0, -1.875, 90.0, 29.28, 0.0, -1.1, 0.0])
    engine.geometry.create_arc3d("钢束-8-N8-1", "TENDON", [0.02, 0.0, -1.5, 0.0, 2.68826, 0.0, -1.875, 25.0, 26.6117, 0.0, -1.875, 25.0, 29.28, 0.0, -1.5, 0.0])
    engine.geometry.create_arc3d("钢束-9-N1-2", "TENDON", [0.02, 0.0, -0.5, 0.0, 9.14167, 0.0, -1.62, 80.0, 21.0628, 0.0, -1.62, 100.0, 29.37, 0.0, -0.6, 0.0])

if __name__ == "__main__":
    from _0_engine import engine
    with batch():
        build_property(engine)
