"""OSIS 命令流 PROPERTY 模块 — 几何属性(坐标系、收缩徐变特性、钢束线型等)"""

from __future__ import annotations

from pyosis import batch

from pyosis.core.engine import OSISEngine

def build_property(engine: OSISEngine) -> None:
    # 创建样条曲线（便捷入口，内部转发到对应 create_* 方法）
    engine.geometry.create_arc3d("钢束-1-N1-1", "TENDON", [0.12, 0.0, -0.4, 0.0, 10.2927, 0.0, -1.29, 45.0, 17.484, 0.0, -1.29, 45.0, 29.657, 0.0, -0.225, 0.0])
    engine.geometry.create_arc3d("钢束-10-N2-2", "TENDON", [0.041, 0.0, -0.475, 0.0, 10.6138, 0.0, -1.4, 45.0, 21.0275, 0.0, -1.4, 45.0, 29.6, 0.0, -0.65, 0.0])
    engine.geometry.create_arc3d("钢束-11-N3-2", "TENDON", [0.019, 0.0, -0.75, 0.0, 8.70584, 0.0, -1.51, 45.0, 22.6277, 0.0, -1.51, 45.0, 29.6, 0.0, -0.9, 0.0])
    engine.geometry.create_arc3d("钢束-12-N4-2", "TENDON", [0.1, 0.0, -1.475, 0.0, 1.53211, 0.0, -1.51, 30.0, 28.1679, 0.0, -1.51, 30.0, 29.6, 0.0, -1.475, 0.0])
    engine.geometry.create_arc3d("钢束-13-T1-1", "TENDON", [1.38, 0.0, -0.14, 0.0, 2.48109, 0.0, -0.09, 10.0, 7.27891, 0.0, -0.09, 10.0, 8.38, 0.0, -0.14, 0.0])
    engine.geometry.create_arc3d("钢束-14-T2-1", "TENDON", [1.38, 0.0, -0.14, 0.0, 2.48109, 0.0, -0.09, 10.0, 15.2789, 0.0, -0.09, 10.0, 16.38, 0.0, -0.14, 0.0])
    engine.geometry.create_arc3d("钢束-15-T1-2", "TENDON", [1.4, 0.0, -0.14, 0.0, 2.50109, 0.0, -0.09, 10.0, 7.29891, 0.0, -0.09, 10.0, 8.4, 0.0, -0.14, 0.0])
    engine.geometry.create_arc3d("钢束-16-T2-2", "TENDON", [1.4, 0.0, -0.14, 0.0, 2.50109, 0.0, -0.09, 10.0, 15.2989, 0.0, -0.09, 10.0, 16.4, 0.0, -0.14, 0.0])
    engine.geometry.create_arc3d("钢束-2-N2-1", "TENDON", [0.12, 0.0, -0.65, 0.0, 8.69254, 0.0, -1.4, 45.0, 19.1062, 0.0, -1.4, 45.0, 29.679, 0.0, -0.475, 0.0])
    engine.geometry.create_arc3d("钢束-3-N3-1", "TENDON", [0.12, 0.0, -0.9, 0.0, 7.09233, 0.0, -1.51, 45.0, 21.0142, 0.0, -1.51, 45.0, 29.701, 0.0, -0.75, 0.0])
    engine.geometry.create_arc3d("钢束-4-N4-1", "TENDON", [0.12, 0.0, -1.475, 0.0, 1.55211, 0.0, -1.51, 30.0, 28.1879, 0.0, -1.51, 30.0, 29.62, 0.0, -1.475, 0.0])
    engine.geometry.create_arc3d("钢束-5-N5-1", "TENDON", [0.063, 0.0, -0.225, 0.0, 12.236, 0.0, -1.29, 45.0, 17.364, 0.0, -1.29, 45.0, 29.537, 0.0, -0.225, 0.0])
    engine.geometry.create_arc3d("钢束-6-N6-1", "TENDON", [0.041, 0.0, -0.475, 0.0, 10.6138, 0.0, -1.4, 45.0, 18.9862, 0.0, -1.4, 45.0, 29.559, 0.0, -0.475, 0.0])
    engine.geometry.create_arc3d("钢束-7-N7-1", "TENDON", [0.019, 0.0, -0.75, 0.0, 8.70584, 0.0, -1.51, 45.0, 20.8942, 0.0, -1.51, 45.0, 29.581, 0.0, -0.75, 0.0])
    engine.geometry.create_arc3d("钢束-8-N8-1", "TENDON", [0.1, 0.0, -1.475, 0.0, 1.53211, 0.0, -1.51, 30.0, 28.0679, 0.0, -1.51, 30.0, 29.5, 0.0, -1.475, 0.0])
    engine.geometry.create_arc3d("钢束-9-N1-2", "TENDON", [0.063, 0.0, -0.225, 0.0, 12.236, 0.0, -1.29, 45.0, 19.4273, 0.0, -1.29, 45.0, 29.6, 0.0, -0.4, 0.0])

if __name__ == "__main__":
    from _0_engine import engine
    with batch():
        build_property(engine)
