"""OSIS 命令流 PROPERTY 模块 — 几何属性(坐标系、收缩徐变特性、钢束线型等)"""

from __future__ import annotations

from pyosis import batch

from pyosis.core.engine import OSISEngine

def build_property(engine: OSISEngine) -> None:
    # 创建样条曲线（便捷入口，内部转发到对应 create_* 方法）
    engine.geometry.create_arc3d("钢束-1-N1-1", "TENDON", [0.16, 0.0, -0.25, 0.0, 7.47523, 0.0, -0.89, 30.0, 12.4448, 0.0, -0.89, 30.0, 19.76, 0.0, -0.25, 0.0])
    engine.geometry.create_arc3d("钢束-10-N2-2", "TENDON", [0.025, 0.0, -0.5, 0.0, 5.74003, 0.0, -1.0, 30.0, 13.91, 0.0, -1.0, 30.0, 19.625, 0.0, -0.5, 0.0])
    engine.geometry.create_arc3d("钢束-11-N3-2", "TENDON", [0.025, 0.0, -0.75, 0.0, 4.13982, 0.0, -1.11, 30.0, 15.5102, 0.0, -1.11, 30.0, 19.625, 0.0, -0.75, 0.0])
    engine.geometry.create_arc3d("钢束-12-N4-2", "TENDON", [0.025, 0.0, -1.045, 0.0, 2.68463, 0.0, -1.11, 30.0, 16.9654, 0.0, -1.11, 30.0, 19.625, 0.0, -1.045, 0.0])
    engine.geometry.create_arc3d("钢束-13-T1-1", "TENDON", [0.79625, 0.0, -0.145, 0.0, 1.79564, 0.0, -0.09, 10.0, 6.79686, 0.0, -0.09, 10.0, 7.79625, 0.0, -0.145, 0.0])
    engine.geometry.create_arc3d("钢束-14-T2-1", "TENDON", [0.79625, 0.0, -0.145, 0.0, 1.79564, 0.0, -0.09, 10.0, 14.7969, 0.0, -0.09, 10.0, 15.7963, 0.0, -0.145, 0.0])
    engine.geometry.create_arc3d("钢束-15-T1-2", "TENDON", [0.8375, 0.0, -0.145, 0.0, 1.83689, 0.0, -0.09, 10.0, 6.83811, 0.0, -0.09, 10.0, 7.8375, 0.0, -0.145, 0.0])
    engine.geometry.create_arc3d("钢束-16-T2-2", "TENDON", [0.8375, 0.0, -0.145, 0.0, 1.83689, 0.0, -0.09, 10.0, 14.8381, 0.0, -0.09, 10.0, 15.8375, 0.0, -0.145, 0.0])
    engine.geometry.create_arc3d("钢束-2-N2-1", "TENDON", [0.16, 0.0, -0.5, 0.0, 5.87503, 0.0, -1.0, 30.0, 14.045, 0.0, -1.0, 30.0, 19.76, 0.0, -0.5, 0.0])
    engine.geometry.create_arc3d("钢束-3-N3-1", "TENDON", [0.16, 0.0, -0.75, 0.0, 4.27482, 0.0, -1.11, 30.0, 15.6452, 0.0, -1.11, 30.0, 19.76, 0.0, -0.75, 0.0])
    engine.geometry.create_arc3d("钢束-4-N4-1", "TENDON", [0.16, 0.0, -1.045, 0.0, 2.81963, 0.0, -1.11, 30.0, 17.1004, 0.0, -1.11, 30.0, 19.76, 0.0, -1.045, 0.0])
    engine.geometry.create_arc3d("钢束-5-N5-1", "TENDON", [0.025, 0.0, -0.25, 0.0, 7.34023, 0.0, -0.89, 30.0, 12.3098, 0.0, -0.89, 30.0, 19.625, 0.0, -0.25, 0.0])
    engine.geometry.create_arc3d("钢束-6-N6-1", "TENDON", [0.025, 0.0, -0.5, 0.0, 5.74003, 0.0, -1.0, 30.0, 13.91, 0.0, -1.0, 30.0, 19.625, 0.0, -0.5, 0.0])
    engine.geometry.create_arc3d("钢束-7-N7-1", "TENDON", [0.025, 0.0, -0.75, 0.0, 4.13982, 0.0, -1.11, 30.0, 15.5102, 0.0, -1.11, 30.0, 19.625, 0.0, -0.75, 0.0])
    engine.geometry.create_arc3d("钢束-8-N8-1", "TENDON", [0.025, 0.0, -1.045, 0.0, 2.68463, 0.0, -1.11, 30.0, 16.9654, 0.0, -1.11, 30.0, 19.625, 0.0, -1.045, 0.0])
    engine.geometry.create_arc3d("钢束-9-N1-2", "TENDON", [0.025, 0.0, -0.25, 0.0, 7.34023, 0.0, -0.89, 30.0, 12.3098, 0.0, -0.89, 30.0, 19.625, 0.0, -0.25, 0.0])

if __name__ == "__main__":
    from _0_engine import engine
    with batch():
        build_property(engine)
