"""OSIS 命令流 PROPERTY 模块 — 几何属性(坐标系、收缩徐变特性、钢束线型等)"""

from __future__ import annotations

from pyosis import batch

from pyosis.core.engine import OSISEngine

def build_property(engine: OSISEngine) -> None:
    # 创建样条曲线（便捷入口，内部转发到对应 create_* 方法）
    engine.geometry.create_arc3d("钢束-1-N1-1", "TENDON", [0.18, 0.0, -0.4, 0.0, 6.76172, 0.0, -1.325, 50.0, 18.0183, 0.0, -1.325, 50.0, 24.6, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-10-N2-2", "TENDON", [0.02, 0.0, -0.7, 0.0, 5.35653, 0.0, -1.45, 50.0, 19.1035, 0.0, -1.45, 50.0, 24.44, 0.0, -0.7, 0.0])
    engine.geometry.create_arc3d("钢束-11-N3-2", "TENDON", [0.02, 0.0, -1.0, 0.0, 4.11134, 0.0, -1.575, 50.0, 20.3487, 0.0, -1.575, 50.0, 24.44, 0.0, -1.0, 0.0])
    engine.geometry.create_arc3d("钢束-12-N4-2", "TENDON", [0.02, 0.0, -1.3, 0.0, 1.97673, 0.0, -1.575, 10.0, 22.4833, 0.0, -1.575, 10.0, 24.44, 0.0, -1.3, 0.0])
    engine.geometry.create_arc3d("钢束-13-T1-1", "TENDON", [0.42, 0.0, -0.4, 0.0, 2.40252, 0.0, -0.086, 10.0, 12.4375, 0.0, -0.086, 10.0, 14.42, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-14-T1-2", "TENDON", [0.5, 0.0, -0.4, 0.0, 2.48252, 0.0, -0.086, 10.0, 12.5175, 0.0, -0.086, 10.0, 14.5, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-2-N2-1", "TENDON", [0.18, 0.0, -0.7, 0.0, 5.51653, 0.0, -1.45, 50.0, 19.2635, 0.0, -1.45, 50.0, 24.6, 0.0, -0.7, 0.0])
    engine.geometry.create_arc3d("钢束-3-N3-1", "TENDON", [0.18, 0.0, -1.0, 0.0, 4.27134, 0.0, -1.575, 50.0, 20.5087, 0.0, -1.575, 50.0, 24.6, 0.0, -1.0, 0.0])
    engine.geometry.create_arc3d("钢束-4-N4-1", "TENDON", [0.18, 0.0, -1.3, 0.0, 2.13673, 0.0, -1.575, 10.0, 22.6433, 0.0, -1.575, 10.0, 24.6, 0.0, -1.3, 0.0])
    engine.geometry.create_arc3d("钢束-5-N5-1", "TENDON", [0.02, 0.0, -0.4, 0.0, 6.60172, 0.0, -1.325, 50.0, 17.7983, 0.0, -1.325, 50.0, 24.38, 0.0, -0.4, 0.0])
    engine.geometry.create_arc3d("钢束-6-N6-1", "TENDON", [0.02, 0.0, -0.7, 0.0, 5.35653, 0.0, -1.45, 50.0, 19.0435, 0.0, -1.45, 50.0, 24.38, 0.0, -0.7, 0.0])
    engine.geometry.create_arc3d("钢束-7-N7-1", "TENDON", [0.02, 0.0, -1.0, 0.0, 4.11134, 0.0, -1.575, 50.0, 20.2887, 0.0, -1.575, 50.0, 24.38, 0.0, -1.0, 0.0])
    engine.geometry.create_arc3d("钢束-8-N8-1", "TENDON", [0.02, 0.0, -1.3, 0.0, 1.97673, 0.0, -1.575, 10.0, 22.4233, 0.0, -1.575, 10.0, 24.38, 0.0, -1.3, 0.0])
    engine.geometry.create_arc3d("钢束-9-N1-2", "TENDON", [0.02, 0.0, -0.4, 0.0, 6.60172, 0.0, -1.325, 50.0, 17.8583, 0.0, -1.325, 50.0, 24.44, 0.0, -0.4, 0.0])

if __name__ == "__main__":
    from _0_engine import engine
    with batch():
        build_property(engine)
